---
kind: type
id: T:Autodesk.Revit.DB.OpenForeignOption
source: html/c8247945-7f12-a435-35e0-0879b02d4397.htm
---
# Autodesk.Revit.DB.OpenForeignOption

Options for opening files saved by an application that was not developed or licensed by Autodesk.

## Syntax (C#)
```csharp
public enum OpenForeignOption
```